date = input('дата в формате дд.мм.гггг')
day = int(date[0:2])
month = date[3:5]
first_order = {
    1: "первое",
    2: "второе",
    3: "третье",
    4: "четвертое",
    5: "пятое",
    6: "шестое",
    7: "седьмое",
    8: "восьмое",
    9: "девятое",
    10: "десятое",
    11: "одиннадцатое",
    12: "двенадцатое",
    13: "тринадцатое",
    14: "четырнадцатое",
    15: "пятнадцатое",
    16: "шестнадцатое",
    17: "семнадцатое",
    18: "восемнадцатое",
    19: "девятнадцатое",
    20: "двадцатое",
    21: "двадцать первое",
    22: "двадцать второе",
    23: "двадцать третье",
    24: "двадцать четвертое",
    25: "двадцать пятое",
    26: "двадцать шестое",
    27: "двадцать седьмое",
    28: "двадцать восьмое",
    29: "двадцать девятое",
    30: "тридцатое",
    31: "тридцать первое"
}
month_list = {
    '01': "января",
    '03': "марта",
    '05': "мая",
    '07': "июля",
    '08': "августа",
    '10': "октября",
    '12': "декабря",
    '04': "апреля",
    '06': "июня",
    '09': "сентября",
    '11': "ноября",
    '02': "февраля"
}
date_text=first_order.setdefault(day)
month_text=month_list.setdefault(month)
result=f'{first_order[day]} {month_list[month]} {date[6:10]} года'
print(result)
